In [2]:
import  pandas as pd

In [3]:
animals=['tiger','lion','mouse']
s=pd.Series(animals)

In [4]:
s

0    tiger
1     lion
2    mouse
dtype: object

In [5]:
s.name="Animals"

In [6]:
s.name

'Animals'

In [7]:
s

0    tiger
1     lion
2    mouse
Name: Animals, dtype: object

In [8]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
number=[1,2,3]
pd.Series(number)

0    1
1    2
2    3
dtype: int64

In [10]:
animals=['tiger','lion',None]
pd.Series(animals)

0    tiger
1     lion
2     None
dtype: object

In [11]:
numbers=[1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [12]:
a=2
b=2
a==b

True

In [13]:
import numpy as np

In [14]:
np.nan==None

False

In [15]:
np.nan==np.nan

False

In [16]:
None==None

True

In [17]:
np.isnan(np.nan)

True

In [18]:
sports={'Archery':"Bhutan",'Golf':"Scotlad",'Sumo':"Japan",'Taekwondo':"South Korea"}
s=pd.Series(sports)
s

Archery           Bhutan
Golf             Scotlad
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [19]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [20]:
s=pd.Series(['Tiger','Bear',"Mouse"],index=["India","America","Canada"])
s

India      Tiger
America     Bear
Canada     Mouse
dtype: object

In [21]:
sports={'Archery':"Bhutan",'Golf':"Scotlad",'Sumo':"Japan",'Taekwondo':"South Korea"}
s=pd.Series(sports,index=["Golf",'Sumo',"Hockey"])
s

Golf      Scotlad
Sumo        Japan
Hockey        NaN
dtype: object

**Querying a series**

In [22]:
sports={'Archery':"Bhutan",'Golf':"Scotlad",'Sumo':"Japan",'Taekwondo':"South Korea"}
s=pd.Series(sports)
s

Archery           Bhutan
Golf             Scotlad
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [23]:
s.iloc[3]

'South Korea'

In [24]:
s[3]

'South Korea'

In [25]:
s[0]

'Bhutan'

In [26]:
s.iloc[0]# positions

'Bhutan'

In [27]:
s.loc['Golf']

'Scotlad'

In [28]:
s.keys()

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [29]:
s.loc['Sumo']

'Japan'

In [30]:
s['Sumo']

'Japan'

In [31]:
sports={99:'Butan',100:'Scotland',101:'Japan',102:'South Korea'}
s=pd.Series(sports)

In [32]:
s

99           Butan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [33]:
s.iloc[0]

'Butan'

In [34]:
s.iloc[2]

'Japan'

In [35]:
s.loc[99]

'Butan'

In [36]:
s.loc[102]

'South Korea'

In [37]:
s[99]

'Butan'

In [38]:
s.loc[99]

'Butan'

In [39]:
s=pd.Series([100.00,120.00,101.00,3.00])

In [40]:
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [41]:
for i in s:
    print(i)

100.0
120.0
101.0
3.0

In [42]:
c=0
for i in s:
    c=c+i
print(c)

324.0

In [43]:
import numpy as np
total=np.sum(s)
print(total)

324.0

In [44]:
a=np.random.randint(0,1000,20000)
a

array([535, 500, 713, ..., 191, 255, 200])

In [45]:
len(a)

20000

In [46]:
s=pd.Series(a)
s.head()

0    535
1    500
2    713
3    715
4    807
dtype: int32

In [47]:
%%timeit -n 10
summary=0
for i in s:
    summary+=i

2.96 ms ± 477 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [48]:
%%timeit -n 10
summary=np.sum(s)

189 µs ± 75.4 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [49]:
s.head()

0    535
1    500
2    713
3    715
4    807
dtype: int32

In [50]:
s.head()+2

0    537
1    502
2    715
3    717
4    809
dtype: int32

In [51]:
s+=2
s.head()

0    537
1    502
2    715
3    717
4    809
dtype: int32

In [52]:
s.iteritems()

In [53]:
for i,j in s.iteritems():
    s.set_value(i,j+2)
s.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

0    539
1    504
2    717
3    719
4    811
dtype: int32

In [54]:
s.set_value(0,900)
s.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

0    900
1    504
2    717
3    719
4    811
dtype: int32

In [55]:
%%timeit -n 1
s=pd.Series(np.random.randint(0,1000,10000))
for i,j in s.iteritems():
    s.loc[i]=j+2

4.96 s ± 59 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [56]:
%%timeit -n 1
s=pd.Series(np.random.randint(0,1000,10000))
s+=2

882 µs ± 338 µs per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [ ]:
import pandas as pd

In [5]:
original_sports=pd.Series({'Archery':'Bhutan',
                           'Golf':'Scotland',
                           'sumo':'japan',
                           'Taekwondo':'South Korea'})
cricket_loving_countries=pd.Series(['Australia',
                                    'Barbados',
                                    'Pakistan',
                                    'England'],
                                  index=['Cricket',
                                         'Cricket',
                                         'Cricket',
                                         'Cricket',])
all_countries=original_sports.append(cricket_loving_countries)

In [6]:
original_sports

Archery           Bhutan
Golf            Scotland
sumo               japan
Taekwondo    South Korea
dtype: object

In [7]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [8]:
all_countries

Archery           Bhutan
Golf            Scotland
sumo               japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [12]:
all_countries.loc['Cricket']
all_countries

Archery           Bhutan
Golf            Scotland
sumo               japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [13]:
all_countries[4]='Australia'

In [14]:
all_countries

Archery           Bhutan
Golf            Scotland
sumo               japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

### the DataFrame data structure

In [4]:
import pandas as pd
purchase_1=pd.Series({'Name': 'Chris',
                      'Item Purchased': 'Dog Food',
                      'Cost':22.50})
purchase_2=pd.Series({'Name': 'kevyn',
                      'Item Purchased': 'Kitty Litter',
                      'Cost':2.50})
purchase_3=pd.Series({'Name': 'Vinod',
                      'Item Purchased': 'Bird Seed',
                      'Cost':5.00})
df=pd.DataFrame(
    [purchase_1,purchase_2,purchase_3],
    index=['Store 1','Store 1','Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [5]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [27]:
df.loc['Store 1']

          Name Item Purchased  Cost state State
Store 1  Chris       Dog Food  22.5    ap    ap
Store 1  kevyn   Kitty Litter   2.5    tg    tg

In [6]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [7]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  kevyn   Kitty Litter   2.5

In [8]:
df.loc['Store 1','Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [9]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [10]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [11]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [12]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [13]:
copy_df=df.copy()
copy_df=copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [14]:
copy_df=df.copy()
copy_df.drop('Store 1',inplace=True)
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [28]:
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 2      Bird Seed   5.0

In [29]:
df['location']=None
df

          Name Item Purchased  Cost   state   State location
Store 1  Chris       Dog Food  22.5      ap      ap     None
Store 1  kevyn   Kitty Litter   2.5      tg      tg     None
Store 2  Vinod      Bird Seed   5.0  Mumbai  mumbai     None

In [21]:
df['State']=['ap','tg','delhi']
df

          Name Item Purchased  Cost  state  State
Store 1  Chris       Dog Food  22.5     ap     ap
Store 1  kevyn   Kitty Litter   2.5     tg     tg
Store 2  Vinod      Bird Seed   5.0  delhi  delhi

### update delhi with mumbai in df

In [22]:
df.loc['Store 2','State']='mumbai'
df

          Name Item Purchased  Cost  state   State
Store 1  Chris       Dog Food  22.5     ap      ap
Store 1  kevyn   Kitty Litter   2.5     tg      tg
Store 2  Vinod      Bird Seed   5.0  delhi  mumbai

In [23]:
df['State']

Store 1        ap
Store 1        tg
Store 2    mumbai
Name: State, dtype: object

In [31]:
costs=df['Cost']

In [32]:
costs

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [33]:
costs+=2

In [34]:
costs

Store 1    24.5
Store 1     4.5
Store 2     7.0
Name: Cost, dtype: float64

In [35]:
df

          Name Item Purchased  Cost   state   State location
Store 1  Chris       Dog Food  24.5      ap      ap     None
Store 1  kevyn   Kitty Litter   4.5      tg      tg     None
Store 2  Vinod      Bird Seed   7.0  Mumbai  mumbai     None

In [36]:
import pandas as pd

In [38]:
df=pd.read_csv('olympics.csv')
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
5,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
6,Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
7,Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
8,Azerbaijan (AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
9,Bahamas (BAH),15,5,2,5,12,0,0,0,0,0,15,5,2,5,12
10,Bahrain (BRN),8,0,0,1,1,0,0,0,0,0,8,0,0,1,1
11,Barbados (BAR) [BAR],11,0,0,1,1,0,0,0,0,0,11,0,0,1,1
12,Belarus (BLR),5,12,24,39,75,6,6,4,5,15,11,18,28,44,90
13,Belgium (BEL),25,37,52,53,142,20,1,1,3,5,45,38,53,56,147
14,Bermuda (BER),17,0,0,1,1,7,0,0,0,0,24,0,0,1,1
15,Bohemia (BOH) [BOH] [Z],3,0,1,3,4,0,0,0,0,0,3,0,1,3,4
16,Botswana (BOT),9,0,1,0,1,0,0,0,0,0,9,0,1,0,1
17,Brazil (BRA),21,23,30,55,108,7,0,0,0,0,28,23,30,55,108
18,British West Indies (BWI) [BWI],1,0,0,2,2,0,0,0,0,0,1,0,0,2,2
19,Bulgaria (BUL) [H],19,51,85,78,214,19,1,2,3,6,38,52,87,81,220
20,Burundi (BDI),5,1,0,0,1,0,0,0,0,0,5,1,0,0,1
21,Cameroon (CMR),13,3,1,1,5,1,0,0,0,0,14,3,1,1,5
22,Canada (CAN),25,59,99,121,279,22,62,56,52,170,47,121,155,173,449
23,Chile (CHI) [I],22,2,7,4,13,16,0,0,0,0,38,2,7,4,13
24,China (CHN) [CHN],9,201,146,126,473,10,12,22,19,53,19,213,168,145,526
25,Colombia (COL),18,2,6,11,19,1,0,0,0,0,19,2,6,11,19
26,Costa Rica (CRC),14,1,1,2,4,6,0,0,0,0,20,1,1,2,4
27,Ivory Coast (CIV) [CIV],12,0,1,0,1,0,0,0,0,0,12,0,1,0,1
28,Croatia (CRO),6,6,7,10,23,7,4,6,1,11,13,10,13,11,34
29,Cuba (CUB) [Z],19,72,67,70,209,0,0,0,0,0,19,72,67,70,209
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
118,Sri Lanka (SRI) [SRI],16,0,2,0,2,0,0,0,0,0,16,0,2,0,2
119,Sudan (SUD),11,0,1,0,1,0,0,0,0,0,11,0,1,0,1
120,Suriname (SUR) [E],11,1,0,1,2,0,0,0,0,0,11,1,0,1,2
121,Sweden (SWE) [Z],26,143,164,176,483,22,50,40,54,144,48,193,204,230,627
122,Switzerland (SUI),27,47,73,65,185,22,50,40,48,138,49,97,113,113,323
123,Syria (SYR),12,1,1,1,3,0,0,0,0,0,12,1,1,1,3
124,Chinese Taipei (TPE) [TPE] [TPE2],13,2,7,12,21,11,0,0,0,0,24,2,7,12,21
125,Tajikistan (TJK),5,0,1,2,3,4,0,0,0,0,9,0,1,2,3
126,Tanzania (TAN) [TAN],12,0,2,0,2,0,0,0,0,0,12,0,2,0,2
127,Thailand (THA),15,7,6,11,24,3,0,0,0,0,18,7,6,11,24
128,Togo (TOG),9,0,0,1,1,1,0,0,0,0,10,0,0,1,1
129,Tonga (TGA),8,0,1,0,1,1,0,0,0,0,9,0,1,0,1
130,Trinidad and Tobago (TRI) [TRI],16,2,5,11,18,3,0,0,0,0,19,2,5,11,18
131,Tunisia (TUN),13,3,3,4,10,0,0,0,0,0,13,3,3,4,10
132,Turkey (TUR),21,39,25,24,88,16,0,0,0,0,37,39,25,24,88
133,Uganda (UGA),14,2,3,2,7,0,0,0,0,0,14,2,3,2,7
134,Ukraine (UKR),5,33,27,55,115,6,2,1,4,7,11,35,28,59,122
135,United Arab Emirates (UAE),8,1,0,0,1,0,0,0,0,0,8,1,0,0,1
136,United States (USA) [P] [Q] [R] [Z],26,976,757,666,2399,22,96,102,84,282,48,1072,859,750,2681
137,Uruguay (URU),20,2,2,6,10,1,0,0,0,0,21,2,2,6,10
138,Uzbekistan (UZB),5,5,5,10,20,6,1,0,0,1,11,6,5,10,21
139,Venezuela (VEN),17,2,2,8,12,4,0,0,0,0,21,2,2,8,12
140,Vietnam (VIE),14,0,2,0,2,0,0,0,0,0,14,0,2,0,2
141,Virgin Islands (ISV),11,0,1,0,1,7,0,0,0,0,18,0,1,0,1
142,Yugoslavia (YUG) [YUG],16,26,29,28,83,14,0,3,1,4,30,26,32,29,87
143,Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
144,Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
145,Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
146,Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
147,Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [39]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [41]:
df=pd.read_csv('olympics.csv',index_col=0,skiprows=1)
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [42]:
df.columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [43]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold'+col[4:]},inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver'+col[4:]},inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze'+col[4:]},inplace=True)
    if col[:2]=='%':
        df.rename(columns={col:'#'+col[4:]},inplace=True)
df.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

Querying a Data Frame

#### find the countries names who got more or equal 5 gold medals in summer

In [44]:
len(df['Gold']>=1)

147

In [45]:
df['Gold']>0

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                    True
Australasia (ANZ) [ANZ]                          True
Australia (AUS) [AUS] [Z]                        True
Austria (AUT)                                    True
Azerbaijan (AZE)                                 True
Bahamas (BAH)                                    True
Bahrain (BRN)                                   False
Barbados (BAR) [BAR]                            False
Belarus (BLR)                                    True
Belgium (BEL)                                    True
Bermuda (BER)                                   False
Bohemia (BOH) [BOH] [Z]                         False
Botswana (BOT)                                  False
Brazil (BRA)                                     True
British West Indies (BWI) [BWI]                 False
Bulgaria (BUL) [H]                               True
Burundi (BDI)                                    True
Cameroon (CMR)                                   True
Canada (CAN)                                     True
Chile (CHI) [I]                                  True
China (CHN) [CHN]                                True
Colombia (COL)                                   True
Costa Rica (CRC)                                 True
Ivory Coast (CIV) [CIV]                         False
Croatia (CRO)                                    True
Cuba (CUB) [Z]                                   True
Cyprus (CYP)                                    False
                                                ...
Sri Lanka (SRI) [SRI]                           False
Sudan (SUD)                                     False
Suriname (SUR) [E]                               True
Sweden (SWE) [Z]                                 True
Switzerland (SUI)                                True
Syria (SYR)                                      True
Chinese Taipei (TPE) [TPE] [TPE2]                True
Tajikistan (TJK)                                False
Tanzania (TAN) [TAN]                            False
Thailand (THA)                                   True
Togo (TOG)                                      False
Tonga (TGA)                                     False
Trinidad and Tobago (TRI) [TRI]                  True
Tunisia (TUN)                                    True
Turkey (TUR)                                     True
Uganda (UGA)                                     True
Ukraine (UKR)                                    True
United Arab Emirates (UAE)                       True
United States (USA) [P] [Q] [R] [Z]              True
Uruguay (URU)                                    True
Uzbekistan (UZB)                                 True
Venezuela (VEN)                                  True
Vietnam (VIE)                                   False
Virgin Islands (ISV)                            False
Yugoslavia (YUG) [YUG]                           True
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                             True
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, Length: 147, dtype: bool

In [46]:
only_gold=df.where(df['Gold']>0)
only_gold.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0

In [47]:
only_gold['Gold'].count()

100

In [48]:
only_gold.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0

In [49]:
only_gold=only_gold.dropna()
only_gold.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0

In [50]:
only_gold=df[df['Gold']>0]

In [51]:
only_gold.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480

### find the count of countries who got atleast 1 silver medals in either summer or winter

In [57]:
df[df['Silver.2']>=1]['Silver.2'].count()

126

In [59]:
len(df[(df['Gold']>0)|(df['Gold.1']>0)])

101